app/controllers/api/users_controller.rb

  def index
    @users = User.paginate(page: @page, per_page: @pagesize)
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 3], ["OFFSET", 0]]

  def create
    @user = User.create(firstName: params[:firstName], lastName: params[:lastName], email: params[:email])
---
INSERT INTO "users" ("firstName", "lastName", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstName", "Chinmay"], ["lastName", "Soni"], ["email", "chinmay@soni.com"], ["created_at", "2021-03-07 17:27:46.469074"], ["updated_at", "2021-03-07 17:27:46.469074"]]

  def update
    @user.update(firstName: params[:firstName], lastName: params[:lastName], email: params[:email])
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "chinmay@soni.vom"], ["updated_at", "2021-03-07 17:28:50.762509"], ["id", 1005]]

  def search
    @users = User.where("firstName LIKE :search OR lastName LIKE :search OR email LIKE :search", search: "%#{params[:input]}%")
---
SELECT "users".* FROM "users" WHERE (firstName LIKE 'chi' OR lastName LIKE 'chi' OR email LIKE 'chi')

  def set_user
    @user = User.find_by_id(params[:id])
    return render :json => {status: 500,message: "User not found"} if @user.blank?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1005], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]